# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"                    # lazygit
tap "koekeishiya/formulae"                     # yabai
tap "planetscale/tap"                          # pscale
tap "stripe/stripe-cli"                        # stripe
tap "tursodatabase/tap"                        # turso
tap "FelixKratz/formulae"                      # sketchybar
tap "supabase/tap/"                            # supabase

# Brew

brew "python@3.11"
brew "awscli"
brew "bat"
brew "glib"                                     # C application utility library, needed for exa?
brew "pycparser"                                # C parser
brew "cffi"                                     # C Foreign Function Interface
brew "docutils"                                 # Python documentation utilities
brew "exa"                                      # Modern replacement for ls
brew "exercism"                                 # CLI for exercism.io
brew "fd"                                       # Simple, fast and user-friendly alternative to find
brew "flyctl"                                   # Fly.io CLI
brew "git"                                      # Git distributed version control system
brew "midnight-commander"                       # Terminal File manager 
brew "mysql-client"                             # MySQL client
brew "neovim"                                   # Neovim
brew "node"                                     # Node.js
brew "nvm"                                      # Node Version Manager
brew "tree"                                     # Tree
brew "pass"                                     # Password manager
brew "pnpm"                                     # Fast, disk space efficient package manager
brew "postgresql@14"                            # PostgreSQL
brew "pyenv"                                    # Python version management
brew "pyenv-virtualenv"                         # Pyenv virtualenv
brew "redis"                                    # Redis
brew "rename"                                   # Rename
brew "ripgrep"                                  # Ripgrep
brew "rust"                                     # Rust
brew "stow"                                     # Stow for pas
brew "tldr"                                     # Tldr for command line help
brew "tmux"                                     # Tmux
brew "wget"                                     # Wget
brew "yarn"                                     # Yarn
brew "zsh-completions"                          # Zsh completions
brew "jesseduffield/lazygit/lazygit"            # Lazygit
brew "koekeishiya/formulae/yabai"               # Yabai
brew "koekeishiya/formulae/skhd"                # skhd
brew "planetscale/tap/pscale"                   # Planetscale
brew "stripe/stripe-cli/stripe"                 # Stripe
brew "tursodatabase/tap/turso"                  # Turso
brew "sketchybar"                               # Sketchybar
brew "font-hack-nerd-font"                      # Nerd Font
brew "jq"                                       # jq for json
brew "neofetch"                                 # Neofetch
brew "supabase/tap/supabase"                    # Supabase

# Casks 

cask "background-music"
cask "font-caskaydia-cove-nerd-font"
cask "monitorcontrol"
cask "kitty"

# VS Code

vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "chaitanyashahare.lazygit"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "jdinhlife.gruvbox"
vscode "kamikillerto.vscode-colorize"
vscode "letrieu.expand-region"
vscode "meganrogge.template-string-converter"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "silesky.toggle-boolean"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xyc.vscode-mdx-preview"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
